# IsEmpty Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
ElectricalSystemSet..::..IsEmpty Property
ElectricalSystemSet Class See Also
---
Test to see if the set is empty.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
public virtual bool IsEmpty { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property IsEmpty As Boolean
	Get
```

Visual C++
---
```text
public:
virtual property bool IsEmpty {
	bool get ();
}
```

# Remarks
If the set is empty then True will be returned, otherwise False.
# See Also
ElectricalSystemSet Class
Autodesk.Revit.DB.Electrical Namespace